app/controllers/clientes_controller.rb

SELECT "clientes".* FROM "clientes"
---
  def index
    @clientes = Cliente.all

INSERT INTO "clientes" ("nome", "telefone", "celular", "endereco", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "jorliano"], ["telefone", "58585858"], ["celular", "58585858"], ["endereco", "teste"], ["created_at", "2015-08-22 18:52:13.656789"], ["updated_at", "2015-08-22 18:52:13.656789"]]
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_cliente
      @cliente = Cliente.find(params[:id])