app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos"
---
  def index
    @produtos = Produto.all

INSERT INTO "produtos" ("nome", "preco", "espicificacao", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "teste"], ["preco", "10.5"], ["espicificacao", "teste"], ["created_at", "2015-08-22 19:05:19.786914"], ["updated_at", "2015-08-22 19:05:19.786914"]]
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save

DELETE FROM "produtos" WHERE "produtos"."id" = $1  [["id", 5]]
---
  def destroy
    @produto.destroy

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = $1 LIMIT 1  [["id", 5]]
---
    def set_produto
      @produto = Produto.find(params[:id])