app/controllers/vendas_controller.rb

  def index
    @vendas = Venda.all
---
SELECT "vendas".* FROM "vendas"

  def create
    @venda = Venda.new(venda_params)

    respond_to do |format|
      if @venda.save
---
INSERT INTO "vendas" ("produto_id", "cliente_id", "quantidade", "valor", "data", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["produto_id", 1], ["cliente_id", 1], ["quantidade", 6], ["valor", "10.2"], ["data", "2015-08-22"], ["created_at", "2015-08-22 19:05:49.022030"], ["updated_at", "2015-08-22 19:05:49.022030"]]

    def set_venda
      @venda = Venda.find(params[:id])
---
SELECT  "vendas".* FROM "vendas" WHERE "vendas"."id" = $1 LIMIT 1  [["id", 1]]